Repository: matiasyurquina/portfolio
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: Home
pt: Início

source: Projects
pt: Projetos

source: Languages
pt: Idiomas

source: About Me
pt: Sobre Mim

source: Contact
pt: Entre em contato

source: Matias Yurquina - Web Developer
pt: Matias Yurquina - Desenvolvedor

source: Programmer with studies at the National University of Tucuman - Argentina, with real experience in web development, Visual Basic, PostgreSQL database and more.
pt: Programador com estudos na Universidade Nacional de Tucumán - Argentina, com experiência real em desenvolvimento web, Visual Basic, banco de dados PostgreSQL e muito mais.

source: Brief overview of the projects I participated in
pt: Breve visão geral dos projetos dos quais participei

source: Bingo Control
pt: Controle de Bingo

source: This is a program made entirely by me, as its name indicates this small program is used to control if a bingo is ready to play or not.
pt: Como o nome indica, esse pequeno programa é usado para controlar se um bingo está pronto para ser jogado ou não.

source: Student Management System
pt: Sistema de Gerenciamento de Alunos

source: This system is used to control the academic status of each student, to register for exams, to register for subjects, etc.
pt: Esse sistema é usado para controlar o status acadêmico de cada aluno, para se inscrever em exames, para se inscrever em disciplinas, etc.

source: MotoCronos is a simple and short program, which serves to time motorcycle and bicycle races and can also save them.
pt: O MotoCronos é um programa simples e curto, que serve para cronometrar corridas de motocicletas e bicicletas e também pode salvá-las.

source: Agricultural Gross Margin
pt: Margem bruta agrícola

source: This system is used to know how profitable is the breeding of a certain animal or some type of plant, taking into account all the existing variables that are necessary. This was my thesis.
pt: Esse sistema é usado para saber quão lucrativa é a criação de um determinado animal ou algum tipo de planta, levando em conta todas as variáveis existentes que são necessárias. Essa foi minha tese.

source: Kids Management
pt: Gerenciamento de Crianças

source: Kids Management is a system program used to register children with all their data/data of their parents and group them by different types of characteristics such as names, surnames, age, etc.
pt: O Gerenciamento de Crianças é um programa de sistema usado para registrar crianças com todos os seus dados/dados de seus pais e agrupá-las por diferentes tipos de características, como nomes, sobrenomes, idade, etc.

source: Code Lines
pt: Linhas de código

source: Years of Experience
pt: Anos de experiência

source: Sleepless nights
pt: Noites sem dormir

source: Frustrations Overcome
pt: Frustrações superadas

source: Spanish, English and Portugues
pt: Espanhol, Inglês e Português

source: Languages I can speak
pt: Idiomas que posso falar

source: As an Argentinean I speak <b>Spanish</b> natively, during my adolescence I studied <b>English</b> (whose language I improved by putting it into practice in these last 8 months) and during the COVID-19 pandemic I studied <b>Portuguese</b> for pure pleasure, in which I reached a very good level although I don't use it too much nowadays.
pt: Como argentino, falo <b>Espanhol</b> nativamente, durante minha adolescência estudei <b>Inglês</b> (cujo idioma melhorei colocando-o em prática nesses últimos 8 meses) e durante a pandemia da COVID-19 estudei <b>Português</b> por puro prazer, no qual atingi um nível muito bom, embora não o utilize muito atualmente.

source: Programming Languages
pt: Linguagens de programação

source: Python and Django
pt: Python e Django

source: The last year while I was working, in my free time <br>I started to learn Django by my own. After a month I started my first project, the Kids Management.
pt: No ano passado, enquanto eu estava trabalhando, comecei a aprender Django por conta própria em meu tempo livre. Depois de um mês, iniciei meu primeiro projeto, o Gerenciamento de Crianças.

source: In my last year of university I learned the concepts of functions, triggers, etc. which I reinforced much more in the following years when I used them in real projects.
pt: Em meu último ano de universidade, aprendi os conceitos de funções, acionadores, etc., que reforcei muito mais nos anos seguintes, quando os usei em projetos reais.

source: Other knowledges
pt: Outros conhecimentos

source: ER-Studio, PHP, JS, Java, C, MySQL, Laravel and more.
pt: ER-Studio, PHP, JS, Java, C, MySQL, Laravel e mais.

source: Other languages and technologies
pt: Outras linguagens e tecnologias

source: During my time as a student I studied and practiced many hours of some of the technologies and languages mentioned above that I later used as a freelance developer.
pt: Durante meu período como estudante, estudei e pratiquei muitas horas de algumas das tecnologias e linguagens mencionadas acima, que mais tarde usei como desenvolvedor autônomo

source: Where am I and why?
pt: ¿Onde estou e por quê?

source: I am currently in Abu Dhabi - U.A.E. working since December 2022 as a waiter, living a unique experience, very fruitful on a personal and professional level as I am learning how to deal with people developing my soft skills, also making friends and contacts, basically getting out of my comfort zone from which it is always difficult to leave.
pt: Atualmente estou em Abu Dhabi - U.A.E. trabalhando desde dezembro de 2022 como garçom, vivendo uma experiência única, muito proveitosa em nível pessoal e profissional, pois estou aprendendo a lidar com as pessoas, desenvolvendo minhas soft skills, também fazendo amigos e contatos, basicamente saindo da minha zona de conforto da qual é sempre difícil sair.

source: How can I contribute to the company?
pt: ¿Como posso contribuir para a empresa?

source: I could contribute with my proactivity, seeing what is needed before it is needed, provide all my knowledge and what I don't know, learn it quickly either by my own means or in my team, keep learning on my own and update myself as it is something I do regularly and not get stuck when getting a job, help my colleagues and always think about growing within the company. <br> And of course, all my commitment and responsibility to do the designated work within the agreed time.
pt: Eu poderia contribuir com minha proatividade, vendo o que é necessário antes que seja necessário, fornecendo todo o meu conhecimento e o que não sei, aprendendo rapidamente por mim mesmo ou com minha equipe, continuando a aprender por conta própria e me atualizando, pois é algo que faço regularmente e não fico preso ao conseguir um emprego, ajudo meus colegas e sempre penso em crescer dentro da empresa. <br> E, é claro, todo o meu comprometimento e responsabilidade para realizar o trabalho designado dentro do prazo acordado.

source: Brief story about Me
pt: Breve história sobre mim

source: I was born and raised in Salta, north of Argentina 32 years ago, I was one of the few people who grew up with a computer in the 90's in my country, so I discovered programming (without knowing I was programming) creating and editing characters of the game Earth's Special Forces (a Counter Strike's mod of Dragon Ball Z) at about 14 years old and from then on I never stopped, although I took some breaks to work on other things, because in my country there are not many opportunities as a programmer.
pt: Nasci e cresci em Salta, no norte da Argentina, há 32 anos, e fui uma das poucas pessoas que cresceram com um computador na década de 90 em meu país, então descobri a programação (sem saber que estava programando) criando e editando personagens do jogo Earth's Special Forces (um mod de Counter Strike mod de Counter Strike de Dragon Ball Z) com cerca de 14 anos e, a partir daí, nunca mais nunca parei, embora tenha feito algumas pausas para trabalhar em outras coisas, porque em meu não há muitas oportunidades como programador.

source: Where did I work before?
pt: ¿Onde eu trabalhei antes?

source: I worked as an IT support intern for 18 months at 'Conectar Igualdad', as a freelance software developer for 3 years and finally as a remote technical support in the most famous internet company in Argentina for almost 3 years before coming to the UAE.
pt: Trabalhei como estagiário de suporte de TI por 18 meses no programa 'Conectar Igualdad', como desenvolvedor de software freelancer por 3 anos e, finalmente, como suporte técnico remoto na empresa de Internet mais famosa da Argentina por quase 3 anos antes de vir para os Emirados Árabes Unidos.

source: Contact me
pt: Entre em contato

source: Enter your name*
pt: Digite seu nome*

source: Enter your email*
pt: Digite seu e-mail*

source: Subject
pt: Assunto

source: Enter your message
pt: Digite sua mensagem

source: Send Message
pt: Enviar

source: Thanks for visiting my website.
pt: Obrigado por visitar meu site.

source: Coded by Matias Exequiel Yurquina
pt: Codificado por Matias Exequiel Yurquina
